app/controllers/posts_controller.rb

  def index
    #@posts = Post.all
    @posts = Post.order('created_at DESC')
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC

  def show
    require 'net/http'
    require 'net/https'
    require 'uri'
    require 'json'

    begin
      group_id = @post.groupId
      parameters = {"v" => "5.95", "access_token" => @post.token}

      url = "https://api.vk.com/method/photos.getWallUploadServer?group_id=" + group_id.to_s
      serverInfo = make_request(url, parameters)

      uri = URI.parse serverInfo["upload_url"]
      connection = Net::HTTP.new uri.host, uri.port
      connection.use_ssl = true
      request = Net::HTTP::Post.new uri
      form_data = [
        ['photo',  File.open(@post.image.current_path)]
      ]
      request.set_form form_data, 'multipart/form-data'
      @response = connection.request request
      photoInfo = JSON.parse(@response.body)

      url = "https://api.vk.com/method/photos.saveWallPhoto?group_id=" + group_id.to_s + "&server=" + photoInfo["server"].to_s + "&photo=" + photoInfo["photo"].to_s + "&hash=" + photoInfo["hash"].to_s
---
INSERT INTO "posts" ("image", "descriprion", "created_at", "updated_at", "token") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["image", "Снимок_экрана_от_2019-06-14_00-19-36.png"], ["descriprion", "123"], ["created_at", "2019-06-14 12:07:35.087628"], ["updated_at", "2019-06-14 12:07:35.087628"], ["token", "12345"]]

  def create
    @post = Post.new(post_params)

    if @post.save
---
INSERT INTO "posts" ("image", "descriprion", "created_at", "updated_at", "token", "groupId") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    if @post.update_attributes(post_params)
---
UPDATE "posts" SET "groupId" = $1, "image" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["groupId", "100577242"], ["image", "a4ce1c6254dbccdc47dda16f412ddeb9.png"], ["updated_at", "2019-06-14 18:03:49.944106"], ["id", 6]]